/**
   Требования к задаче:
   1. Реализовать класс Tracker. Класс трекер - это обертка над массивом;
   2. В классе должно быть поле private Item[] items;
   3. Данный класс используется, как хранилище для заявок;
   4. В нем должны быть следующие методы:
   добавление заявок - public Item add(Item);
   редактирование заявок - public void update(Item);
   удаление заявок - public void delete(Item);
   получение списка всех заявок - public Item[] findAll();
   получение списка по имени - public Item[] findByName(String key);
   получение заявки по id - public Item findById(String id);
   5. На все методы необходимо написать тесты.
 */
